In [2]:
import sqlite3

In [3]:
db=sqlite3.connect("Student_databse.db")

In [4]:
cur=db.cursor()

In [4]:
cur.execute("create table students(id int primary key, name text,mrks int)")

In [5]:
cur.execute("Insert into students(id,name,mrks) values(1,'Ram',59)")

In [6]:
db.commit()

In [7]:
print(cur.rowcount,'Record(s) inserted')

1 Record(s) inserted

In [8]:
cur.execute("Insert into students(id,name,mrks) values(2,'Shyam',49)")
db.commit()

In [9]:
print(cur.rowcount,'Record(s) inserted')

1 Record(s) inserted

In [10]:
results=cur.execute("select * from students")
for row in results:
    print(row)

(1, 'Ram', 59)
(2, 'Shyam', 49)

In [12]:
cur.execute("Insert into students(id,name,mrks) values(3,'Rohit',69)")
db.commit()

In [13]:
results=cur.execute("select * from students")
for row in results:
    print(row)

(1, 'Ram', 59)
(2, 'Shyam', 49)
(3, 'Rohit', 69)

In [14]:
cur.execute("insert into students values(4,'Jyoti',56),(5,'Yash',54)")
db.commit()
print(cur.rowcount)

2

In [15]:
results=cur.execute('select * from students')
for i in results:
    print(i)

(1, 'Ram', 59)
(2, 'Shyam', 49)
(3, 'Rohit', 69)
(4, 'Jyoti', 56)
(5, 'Yash', 54)

In [4]:
db1=sqlite3.connect("c:/mysqlite_databse2/studentdb.db")

In [5]:
cur1=db1.cursor()

In [6]:
cur1.execute("create table employees (id int,name text,age int)")

In [8]:
cur.execute("insert into employees Values(1,'Shalu',32)")
db1.commit()

OperationalError: no such table: employees

this is the way to add table into known location according to us wwe have to make a folder in the selected location and then creat any databse as required.

## Accessing data stored in SQLite using Python.

In [9]:
results=cur.execute("select * from students")
for i in results:
    print(i)

(1, 'Ram', 59)
(2, 'Shyam', 49)
(3, 'Rohit', 69)
(4, 'Jyoti', 56)
(5, 'Yash', 54)

In [11]:
results=cur.execute("select id, name from students")
for i in results:
    print(i)

(1, 'Ram')
(2, 'Shyam')
(3, 'Rohit')
(4, 'Jyoti')
(5, 'Yash')

In [12]:
results=cur.execute("select * from students where id=5")
for i in results:
    print(i)

(5, 'Yash', 54)

In [13]:
results=cur.execute("select * from students limit 3")
for i in results:
    print(i)

(1, 'Ram', 59)
(2, 'Shyam', 49)
(3, 'Rohit', 69)

In [14]:
results=cur.execute("select name from students where id=4")
for i in results:
    print(i)

('Jyoti',)

In [16]:
results=cur.execute("select * from students where mrks>60 and mrks<90")
for i in results:
    print(i)

(3, 'Rohit', 69)

In [17]:
results=cur.execute("select * from students where mrks between 60 and 90 ")
for i in results:
    print(i)

(3, 'Rohit', 69)

In [18]:
results=cur.execute("select * from students order by name asc")
for i in results:
    print(i)

(4, 'Jyoti', 56)
(1, 'Ram', 59)
(3, 'Rohit', 69)
(2, 'Shyam', 49)
(5, 'Yash', 54)

In [19]:
results=cur.execute("select * from students order by name desc")
for i in results:
    print(i)

(5, 'Yash', 54)
(2, 'Shyam', 49)
(3, 'Rohit', 69)
(1, 'Ram', 59)
(4, 'Jyoti', 56)

In [20]:
results=cur.execute("select min(mrks) from students")
for i in results:
    print(i)

(49,)

In [21]:
results=cur.execute("select sum(mrks) from students")
for i in results:
    print(i)

(287,)

In [24]:
results=cur.execute("select * from students where name like 'R%'")
for i in results:
    print(i)

(1, 'Ram', 59)
(3, 'Rohit', 69)

In [6]:
results=cur.execute("select sum(mrks) from students")
results.fetchone()

(287,)

In [7]:
results=cur.execute("select sum(mrks) from students")
results.fetchall()

[(287,)]

In [8]:
results=cur.execute("select * from students where mrks is null")
results.fetchone()

In [10]:
results=cur.execute("select * from students where mrks is not null")
results.fetchall()

[(1, 'Ram', 59),
 (2, 'Shyam', 49),
 (3, 'Rohit', 69),
 (4, 'Jyoti', 56),
 (5, 'Yash', 54)]